{
  "newArticles" : [ {
    "description" : "Shares of Keysight Technologies Inc. rose nearly 6% in the extended session Tuesday after the electronics company spun off from Agilent Technologies reported fiscal fourth-quarter results that beat Wall Street forecasts. Keysight said it lost $114 million, or 61 cents a share, compared with a net loss of $38 million, or 20 cents a share, in the fourth quarter of 2017. Adjusted for one-time items, Keysight earned $193 million, or $1.01 a share, compared with $135 million, or 71 cents a share, a year ago. Revenue rose 19% to $1.05 billion, compared with $878 million a year ago. Analysts polled by FactSet had expected the company to report adjusted earnings of 90 cents a share on sales of $1.02 billion. Keysight shares ended the regular trading day down 2.3%.",
    "title" : "Keysight Technologies stock up 6% after company beats Wall Street views",
    "url" : "https://finance.yahoo.com/m/64892a7c-69d4-3c33-b568-64f06195d288/keysight-technologies-stock.html?.tsrc=rss"
  }, {
    "description" : "Investing.com - Urban Outfitters, Agilent Technologies and Jack in the Box rallied heading into close Tuesday, shrugging off steep selling across Wall Street.",
    "title" : "Urban Outfitters, Agilent, Jack in the Box Shrug off Market Rout",
    "url" : "https://finance.yahoo.com/news/urban-outfitters-agilent-jack-box-221400627.html?.tsrc=rss"
  }, {
    "description" : "Check out the companies making headlines before the bell: Target TGT – The retailer earned an adjusted $1.09 per share for the third quarter , 3 cents a share below estimates. Revenue exceeded forecasts, however, and comparable-store sales were up 5.",
    "title" : "Stocks making the biggest move premarket: TGT, BBY, KSS, LOW, MDT & more",
    "url" : "https://finance.yahoo.com/m/b7cc2f05-1d3e-3573-9a3f-15a06311ec7f/stocks-making-the-biggest.html?.tsrc=rss"
  },{
    "description" : "Monday's sharp losses are likely to extend into a second day on Wall Street, with futures sharply lower and a loss of confidence in leading tech names continuing to weigh on investors.",
    "title" : "Tech pulls market lower | Bitcoin drops 15% | Target tumbles on earnings",
    "url" : "https://finance.yahoo.com/m/56dfd40b-14f4-3cb8-8505-5c01b769fc8c/tech-pulls-market-lower-%7C.html?.tsrc=rss"
  },{
    "description" : "A earnings call for the period ending October 31, 2018.",
    "title" : "Agilent Technologies Inc (A) Q4 2018 Earnings Conference Call Transcript",
    "url" : "https://finance.yahoo.com/news/agilent-technologies-inc-q4-2018-025955930.html?.tsrc=rss"
  },{
    "description" : "Investing.com - Agilent Technologies (NYSE:A) reported fourth quarter earnings that beat analysts&apos; expectations on Monday and revenue that topped forecasts.",
    "title" : "Agilent Technologies Earnings, Revenue beat in Q4",
    "url" : "https://finance.yahoo.com/news/agilent-technologies-earnings-revenue-beat-004807696.html?.tsrc=rss"
  },{
    "description" : "Investing.com - Urban Outfitters, Agilent Technologies and Jack in the Box rallied heading into close Tuesday, shrugging off steep selling across Wall Street.",
    "title" : "Urban Outfitters, Agilent, Jack in the Box Shrug off Market Rout",
    "url" : "https://finance.yahoo.com/news/urban-outfitters-agilent-jack-box-221400627.html?.tsrc=rss"
  },{
    "description" : "Agilent (A) delivered earnings and revenue surprises of 10.96% and 3.05%, respectively, for the quarter ended October 2018. Do the numbers hold clues to what lies ahead for the stock?",
    "title" : "Agilent Technologies (A) Q4 Earnings and Revenues Top Estimates",
    "url" : "https://finance.yahoo.com/news/agilent-technologies-q4-earnings-revenues-224010468.html?.tsrc=rss"
  },{
    "description" : "The manufacturing company said that for its fourth quarter of fiscal 2018, it brought in net income of 81 cents per share, which marked a 21% increase compared to what the company amassed during the year-ago quarter. On a GAAP basis, Agilent said that its net income came in at $195 million, or 61 cents per share, topping the $177 million, or 54 cents per share from the year-ago quarter. “Our performance this quarter caps off an excellent 2018 as we achieved our highest annual core growth rate and profitability since becoming a stand-alone life sciences company in 2014,” said Agilent CEO Mike McMullen.",
    "title" : "Agilent Stock Surges on Q4 Earnings Beat",
    "url" : "https://finance.yahoo.com/news/agilent-stock-surges-q4-earnings-220059929.html?.tsrc=rss"
  }
  ]
}
